app/controllers/artists_controller.rb

  def index
    if params[:song_id]
      @artists = Song.find(params[:song_id]).artists
    else
    @artists = Artist.all
---
SELECT "artists".* FROM "artists"